Autodesk.Revit.DB.TableMergedCell.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableMergedCell.Right
Specifies the column index of the bottom-right corner of a table grid.
Since:
2011

Autodesk.Revit.DB.TableMergedCell.Bottom
Specifies the row index of the bottom-right corner of a table grid.
Since:
2011

Autodesk.Revit.DB.TableMergedCell.Left
Specifies the column index of the top-left corner of a table grid.
Since:
2011

Autodesk.Revit.DB.TableMergedCell.Top
Specifies the row index of the top-left corner of a table grid.
Since:
2011

Autodesk.Revit.DB.TableMergedCell.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)
Constructor.
top:
Row index of the top-left of a table grid.
left:
Column index of the top-left of a table grid.
bottom:
Row index of the bottom-right of a table grid.
right:
Column index of the bottom-right of a table grid.
Since:
2011

Autodesk.Revit.DB.TableMergedCell.#ctor
Default constructor.
Since:
2011

Autodesk.Revit.DB.TableMergedCell
The TableMergedCell class defines a merged area of the upper-left and lower-right of a table grid.
Remarks:
A TableMergedCell contains member variables that define the top-left and bottom-right row and column indexes of a table grid.
A TableMergedCell object can be passed as a function parameter wherever a TableMergedCell can be passed.
Since:
2011